## Staging: common
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 4 to add, 1 to change, 6 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                  NAME                                  |
|--------|------------------------------------------------------------------------|
| update | `module.s3_scan_objects.aws_s3_bucket_notification.s3_scan_object`     |
| add    | `module.s3_scan_objects.aws_kms_alias.s3_scan_object_queue`            |
|        | `module.s3_scan_objects.aws_kms_key.s3_scan_object_queue`              |
|        | `module.s3_scan_objects.aws_sqs_queue.s3_scan_object`                  |
|        | `module.s3_scan_objects.aws_sqs_queue_policy.s3_scan_object`           |
| delete | `module.s3_scan_objects.aws_cloudwatch_log_group.s3_scan_object`       |
|        | `module.s3_scan_objects.aws_iam_policy.s3_scan_object`                 |
|        | `module.s3_scan_objects.aws_iam_role.s3_scan_object`                   |
|        | `module.s3_scan_objects.aws_iam_role_policy_attachment.s3_scan_object` |
|        | `module.s3_scan_objects.aws_lambda_function.s3_scan_object`            |
|        | `module.s3_scan_objects.aws_lambda_permission.s3_execute`              |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
 <= read (data resources)

Terraform will perform the following actions:

  # module.s3_scan_objects.data.aws_iam_policy_document.s3_scan_object will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "s3_scan_object"  {
      ~ id      = "323479863" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:logs:ca-central-1:239043911459:log-group:/aws/lambda/s3-scan-object-gc-notify:log-stream:*",
                          - "arn:aws:logs:ca-central-1:239043911459:log-group:/aws/lambda/s3-scan-object-gc-notify",
                        ]
                      - Sid      = ""
                    },
                  - {
                      - Action   = "lambda:InvokeFunction"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:lambda:ca-central-1:806545929748:function:s3-scan-object"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          ~ actions       = [
              - "logs:CreateLogStream",
              - "logs:PutLogEvents",
              + "sqs:SendMessage",
            ]
          - not_actions   = [] -> null
          - not_resources = [] -> null
          ~ resources     = [
              - "arn:aws:logs:ca-central-1:239043911459:log-group:/aws/lambda/s3-scan-object-gc-notify",
              - "arn:aws:logs:ca-central-1:239043911459:log-group:/aws/lambda/s3-scan-object-gc-notify:log-stream:*",
              ~ (known after apply),
            ]
          + sid           = "S3sendToSQS"
            # (1 unchanged attribute hidden)

          + condition {
              + test     = "ArnEquals"
              + values   = [
                  + "arn:aws:s3:::notification-canada-ca-staging-document-download-scan-files",
                ]
              + variable = "aws:SourceArn"
            }

          + principals {
              + identifiers = [
                  + "s3.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
      ~ statement {
          ~ actions       = [
              - "lambda:InvokeFunction",
              + "sqs:DeleteMessage",
              + "sqs:GetQueueAttributes",
              + "sqs:ReceiveMessage",
            ]
          - not_actions   = [] -> null
          - not_resources = [] -> null
          ~ resources     = [
              - "arn:aws:lambda:ca-central-1:806545929748:function:s3-scan-object",
              ~ (known after apply),
            ]
          + sid           = "LambdaTriggerFromSQS"
            # (1 unchanged attribute hidden)

          + principals {
              + identifiers = [
                  + "arn:aws:iam::806545929748:role/s3-scan-object",
                ]
              + type        = "AWS"
            }
        }
    }

  # module.s3_scan_objects.aws_cloudwatch_log_group.s3_scan_object will be destroyed
  # (because aws_cloudwatch_log_group.s3_scan_object is not in configuration)
  - resource "aws_cloudwatch_log_group" "s3_scan_object" {
      - arn               = "arn:aws:logs:ca-central-1:239043911459:log-group:/aws/lambda/s3-scan-object-gc-notify" -> null
      - id                = "/aws/lambda/s3-scan-object-gc-notify" -> null
      - name              = "/aws/lambda/s3-scan-object-gc-notify" -> null
      - retention_in_days = 7 -> null
      - tags              = {
          - "CostCentre" = "notification-canada-ca-staging"
          - "Terraform"  = "true"
        } -> null
      - tags_all          = {
          - "CostCentre" = "notification-canada-ca-staging"
          - "Terraform"  = "true"
        } -> null
    }

  # module.s3_scan_objects.aws_iam_policy.s3_scan_object will be destroyed
  # (because aws_iam_policy.s3_scan_object is not in configuration)
  - resource "aws_iam_policy" "s3_scan_object" {
      - arn       = "arn:aws:iam::239043911459:policy/S3ScanObject-gc-notify" -> null
      - id        = "arn:aws:iam::239043911459:policy/S3ScanObject-gc-notify" -> null
      - name      = "S3ScanObject-gc-notify" -> null
      - path      = "/" -> null
      - policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:logs:ca-central-1:239043911459:log-group:/aws/lambda/s3-scan-object-gc-notify:log-stream:*",
                          - "arn:aws:logs:ca-central-1:239043911459:log-group:/aws/lambda/s3-scan-object-gc-notify",
                        ]
                      - Sid      = ""
                    },
                  - {
                      - Action   = "lambda:InvokeFunction"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:lambda:ca-central-1:806545929748:function:s3-scan-object"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id = "ANPATPKBAT4R2JYW5Z7IO" -> null
      - tags      = {} -> null
      - tags_all  = {} -> null
    }

  # module.s3_scan_objects.aws_iam_role.s3_scan_object will be destroyed
  # (because aws_iam_role.s3_scan_object is not in configuration)
  - resource "aws_iam_role" "s3_scan_object" {
      - arn                   = "arn:aws:iam::239043911459:role/S3ScanObject-gc-notify" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2023-02-07T14:28:04Z" -> null
      - force_detach_policies = false -> null
      - id                    = "S3ScanObject-gc-notify" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::239043911459:policy/S3ScanObject-gc-notify",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "S3ScanObject-gc-notify" -> null
      - path                  = "/" -> null
      - role_last_used        = [
          - {
              - last_used_date = "2023-06-04T00:08:24Z"
              - region         = "ca-central-1"
            },
        ] -> null
      - tags                  = {} -> null
      - tags_all              = {} -> null
      - unique_id             = "AROATPKBAT4R4GGLN565V" -> null

      - inline_policy {}
    }

  # module.s3_scan_objects.aws_iam_role_policy_attachment.s3_scan_object will be destroyed
  # (because aws_iam_role_policy_attachment.s3_scan_object is not in configuration)
  - resource "aws_iam_role_policy_attachment" "s3_scan_object" {
      - id         = "S3ScanObject-gc-notify-20230207142825144200000002" -> null
      - policy_arn = "arn:aws:iam::239043911459:policy/S3ScanObject-gc-notify" -> null
      - role       = "S3ScanObject-gc-notify" -> null
    }

  # module.s3_scan_objects.aws_kms_alias.s3_scan_object_queue will be created
  + resource "aws_kms_alias" "s3_scan_object_queue" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/s3_scan_object_queue"
      + name_prefix    = (known after apply)
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # module.s3_scan_objects.aws_kms_key.s3_scan_object_queue will be created
  + resource "aws_kms_key" "s3_scan_object_queue" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + description                        = "S3 scan objects KMS key for SQS queue encryption"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "kms:*"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::239043911459:root"
                        }
                      + Resource  = "*"
                      + Sid       = ""
                    },
                  + {
                      + Action    = [
                          + "kms:GenerateDataKey*",
                          + "kms:Decrypt",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS     = "arn:aws:iam::806545929748:role/s3-scan-object"
                          + Service = "s3.amazonaws.com"
                        }
                      + Resource  = "*"
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + tags                               = {
          + "CostCentre" = "notification-canada-ca-staging"
          + "Terraform"  = "true"
        }
      + tags_all                           = {
          + "CostCentre" = "notification-canada-ca-staging"
          + "Terraform"  = "true"
        }
    }

  # module.s3_scan_objects.aws_lambda_function.s3_scan_object will be destroyed
  # (because aws_lambda_function.s3_scan_object is not in configuration)
  - resource "aws_lambda_function" "s3_scan_object" {
      - architectures                  = [
          - "x86_64",
        ] -> null
      - arn                            = "arn:aws:lambda:ca-central-1:239043911459:function:s3-scan-object-gc-notify" -> null
      - filename                       = "/tmp/main.py.zip" -> null
      - function_name                  = "s3-scan-object-gc-notify" -> null
      - handler                        = "main.handler" -> null
      - id                             = "s3-scan-object-gc-notify" -> null
      - invoke_arn                     = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:239043911459:function:s3-scan-object-gc-notify/invocations" -> null
      - last_modified                  = "2023-05-25T14:05:51.000+0000" -> null
      - layers                         = [] -> null
      - memory_size                    = 512 -> null
      - package_type                   = "Zip" -> null
      - publish                        = false -> null
      - qualified_arn                  = "arn:aws:lambda:ca-central-1:239043911459:function:s3-scan-object-gc-notify:$LATEST" -> null
      - qualified_invoke_arn           = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:239043911459:function:s3-scan-object-gc-notify:$LATEST/invocations" -> null
      - reserved_concurrent_executions = 10 -> null
      - role                           = "arn:aws:iam::239043911459:role/S3ScanObject-gc-notify" -> null
      - runtime                        = "python3.8" -> null
      - skip_destroy                   = false -> null
      - source_code_hash               = "ZD1sYT7qTWBeg/9aMCz7U7W3f9uVOSlAw/cOUOr9sQk=" -> null
      - source_code_size               = 632 -> null
      - tags                           = {
          - "CostCentre" = "notification-canada-ca-staging"
          - "Terraform"  = "true"
        } -> null
      - tags_all                       = {
          - "CostCentre" = "notification-canada-ca-staging"
          - "Terraform"  = "true"
        } -> null
      - timeout                        = 120 -> null
      - version                        = "$LATEST" -> null

      - environment {
          - variables = {
              - "ACCOUNT_ID"                  = "239043911459"
              - "LOG_LEVEL"                   = "DEBUG"
              - "S3_SCAN_OBJECT_FUNCTION_ARN" = "arn:aws:lambda:ca-central-1:806545929748:function:s3-scan-object"
            } -> null
        }

      - ephemeral_storage {
          - size = 512 -> null
        }

      - tracing_config {
          - mode = "PassThrough" -> null
        }
    }

  # module.s3_scan_objects.aws_lambda_permission.s3_execute will be destroyed
  # (because aws_lambda_permission.s3_execute is not in configuration)
  - resource "aws_lambda_permission" "s3_execute" {
      - action        = "lambda:InvokeFunction" -> null
      - function_name = "s3-scan-object-gc-notify" -> null
      - id            = "S3ScanObjectS3Invoke-gc-notify" -> null
      - principal     = "s3.amazonaws.com" -> null
      - source_arn    = "arn:aws:s3:::notification-canada-ca-staging-document-download-scan-files" -> null
      - statement_id  = "S3ScanObjectS3Invoke-gc-notify" -> null
    }

  # module.s3_scan_objects.aws_s3_bucket_notification.s3_scan_object will be updated in-place
  ~ resource "aws_s3_bucket_notification" "s3_scan_object" {
        id          = "notification-canada-ca-staging-document-download-scan-files"
        # (2 unchanged attributes hidden)

      - lambda_function {
          - events              = [
              - "s3:ObjectCreated:*",
            ] -> null
          - id                  = "ScanObjectCreated" -> null
          - lambda_function_arn = "arn:aws:lambda:ca-central-1:239043911459:function:s3-scan-object-gc-notify" -> null
        }

      + queue {
          + events    = [
              + "s3:ObjectCreated:*",
            ]
          + id        = "ScanObjectCreated"
          + queue_arn = (known after apply)
        }
    }

  # module.s3_scan_objects.aws_sqs_queue.s3_scan_object will be created
  + resource "aws_sqs_queue" "s3_scan_object" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + kms_master_key_id                 = (known after apply)
      + max_message_size                  = 262144
      + message_retention_seconds         = 345600
      + name                              = "s3-scan-object"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      + sqs_managed_sse_enabled           = (known after apply)
      + tags                              = {
          + "CostCentre" = "notification-canada-ca-staging"
          + "Terraform"  = "true"
        }
      + tags_all                          = {
          + "CostCentre" = "notification-canada-ca-staging"
          + "Terraform"  = "true"
        }
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 300
    }

  # module.s3_scan_objects.aws_sqs_queue_policy.s3_scan_object will be created
  + resource "aws_sqs_queue_policy" "s3_scan_object" {
      + id        = (known after apply)
      + policy    = (known after apply)
      + queue_url = (known after apply)
    }

Plan: 4 to add, 1 to change, 6 to destroy.

Warning: Argument is deprecated

  with aws_s3_bucket.csv_bucket,
  on s3.tf line 5, in resource "aws_s3_bucket" "csv_bucket":
   5: resource "aws_s3_bucket" "csv_bucket" {

Use the aws_s3_bucket_server_side_encryption_configuration resource instead

(and 57 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_athena_workgroup.primary"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.aws_health"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.route53_resolver_query_log"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries_failures"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries_failures_us_west_2"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries_us_west_2"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-bulk-not-being-processed-critical"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-bulk-not-being-processed-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-inflights-not-being-processed-critical"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-inflights-not-being-processed-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-not-being-processed-critical"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-not-being-processed-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.contact-3-500-error-15-minutes-critical"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.document-download-bucket-size-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.expired-email-created-critical"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.expired-email-created-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.expired-sms-created-critical"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
